interface Pointer {
  q: string,
  [key: string]: string
}

export const start: Pointer = {
  q: "Работаешь ли ты в IT сфере? 🤔",
  a1: "Да, это моя стихия 🧑🏻‍💻",
  a2: "Нет, Айти не мое 🤖"
};

export const pointer1: Pointer = {
  q: "Отлично, а что напрягает в работе?",
  a1: "Короткие дедлайны 🫠",
  a2: "Баги в коде ❌",
  a3: "Множество правок 😡"
}

export const pointer11: Pointer = {
  q:
}

export const pointer2: Pointer = {
  q: "Как в целом прошел рабочий год?",
  a1: "Трудно, но интересно 😛",
  a2: "В целом неплохо 🙂",
  a3: "Когда отпуск?? 🥲"
}

export const retry: string = "Начните с самого начала 🔁";
